from app.models.common import DetectMultiBackend

weights_path = "app/weights/best.pt"
device = "cpu"

model = DetectMultiBackend(weights_path, device=device)
model.eval()

class_names = [
    # 집 (15)
    '집전체', '지붕', '집벽', '문', '창문', '굴뚝', '연기', '울타리', '길', '연못', '산', '잔디', '꽃', '태양', '기타_집',
    # 나무 (14)
    '나무전체', '기둥', '수관', '가지', '뿌리', '나뭇잎', '나무꽃', '열매', '그네', '새', '다람쥐', '구름', '달', '별',
    # 여자사람 (18)
    '여자전체', '머리', '얼굴', '눈', '코', '입', '귀', '머리카락', '목', '상체', '팔', '손', '다리', '발', '단추', '주머니', '운동화', '여자구두',
    # 남자사람 (18)
    '남자전체', '머리', '얼굴', '눈', '코', '입', '귀', '머리카락', '목', '상체', '팔', '손', '다리', '발', '단추', '주머니', '운동화', '남자구두'
]
